# DivisionRuleId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PartMakerMethodToDivideVolumes..::..DivisionRuleId Property
PartMakerMethodToDivideVolumes Class See Also
---
Id of the 'DivisionRule' which is used to augment the cutting sketch.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ElementId DivisionRuleId { get; set; }
```

Visual Basic
---
```text
Public Property DivisionRuleId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ DivisionRuleId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The provided element id cannot be assigned as a division rule to this PartMakerMethodToDivideVolumes. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace